# 파이썬을 통한 출력
'''
1. print('출력') : 줄바꿈 포함 
2. print("출력") : 문자열 처리 방법 - '', "" - 한줄 처리 , 
                         ''' ''',  """   """ - 여러줄 처리
3. print("출력", end = ",")  : 마지막에 줄바꾸지 않고, 지정된 문자열로 처리
4. print("출력\n \t")  : \n 줄바꿈 처리, \t 탭간격 처리
5. print(데이터1, 데이터2) : 데이터1과 데이터2를 ,(콤마)를 이용해서 구분하여
    출력한다.
6. print(데이터1 + 데이터2) : + (기호)는 데이터가 같은 유형일 때만 처리가 가능하다.
                         주의) 자바와 자바스크립트와 차이가 난다.
7. print("홀수만 합산:{}".form(데이터/변수))
8. print(f'홀수만 합산:{데이터/변수}')  : 가장 많이 쓰이는 문자열에서 데이터
     출력형식이다.                 




'''
print("안녕")
print('반가워요')
print(''' 
여러 줄을
한번에 출력 할때.
사용됩니다..
''')
print("""출력물 시작
두번째 라인
마지막 라인""")
print("사과")
print("바나나")
print("딸기")




print("사과", end=", ")
print("바나나", end=", ")
print("딸기", end=", ")
print("오렌지", end=", ")
# alt+shift+화살표 아래



